#+TITLE: Statistical arbitrage with pairs trading
#+AUTHOR: Leo Alekseyev
#+property: session *R-babel*

*** Assign sector ETFs to stocks 
 
In the first part of this project, we explore mean-reverting pair trading
between a stock and an ETF from the same sector. Following Avellaneda and
Lee, we pick 15 sector ETFs and associate each stock with an ETF using its
[[http://en.wikipedia.org/wiki/Global_Industry_Classification_Standard][GICS]] classification number.

We use the following correspondence between the GICS numbers and our list of
sector ETFs:

| ETF | Sector                 |          GICS information |
|-----+------------------------+---------------------------|
| HHH | Internet               |                    451010 |
| IYR | Real Estate            |                      4040 |
| IYT | Transportation         |                      2030 |
| OIH | Oil Exploration        |                    101020 |
| RKH | Regional Banks         |                  40101015 |
| RTH | Retail                 |                      2550 |
| SMH | Semi                   |                      4530 |
| UTH | Utilities              |                        55 |
| XLE | Energy                 |            10 excl 101020 |
| XLF | Financials             | 40 excl 4040 and 40101015 |
| XLI | Industrials            |              20 excl 2030 |
| XLI | Materials              |                        15 |
| XLK | Technology             |   45 excl 451010 and 4530 |
| XLK | Telecom                |                        50 |
| XLP | Consumer Staples       |                        30 |
| XLV | Healthcare             |                        35 |
| XLY | Consumer Discretionary |              25 excl 2550 |

Note: we combine materials (15) with industrials (20); telecom (50) with
technology (45), assigning both of the former to XLI and the latter to XLK

In the CRSP data, the GICS numbers are given by the following fields:
=GSECTOR, GGROUP, GIND, GSUBIND=
    
These give classifications of increasing specificity.  For instance, a
security might have a classification of 40101015, where the numbers 40, 4010,
401010, and 40101015 give the =GSECTOR, GGROUP, GIND, GSUBIND= fields, respectively.

To determine the industry information, we retrieve these fields from CRSP for
each symbol in our stock universe. 
:DETAILS:
The results are stored in [[file+emacs:data/symbols/ticker_to_classifiations.csv][ticker_to_classification.csv]]
The fields retrieved are:
gvkey,conm,tic,sic,naics,linkprim,liid,linktype,linkid,lpermno,lpermco,USEDFLAG,linkdt,linkenddt,GSECTOR,GGROUP,GIND,GSUBIND,SPCINDCD,SPCSECCD
To assign the stock/ETF correspondence based on this table above, we use the
following quick-and-dirty Perl script:
[[file:src/get_sector_etfs.pl][get_sector_etfs.pl]]
:END:

The following gives us the stock/ETF correspondence, as well as a quick tally
of the stocks assigned to a particular ETF.  At the end, about 3/4 of the
stocks in our universe end up paired with an ETF.

#+begin_src sh :exports both
  src/get_sector_etfs.pl < data/symbols/ticker_to_classifiations.csv | uniq > workspace/ticker_to_sec_etf.csv
  cd workspace
  for etf in HHH IYR IYT OIH RKH RTH SMH UTH XLE XLF XLI XLK XLP XLV XLY; do 
      echo $(grep $etf ticker_to_sec_etf.csv |wc -l) $etf;
  done
  cut -d',' -f1 ticker_to_sec_etf.csv|sed '1d' > tickers_classified
  wc -l tickers_classified 
#+end_src

#+results:
|   37 | HHH                |
|   76 | IYR                |
|   37 | IYT                |
|   49 | OIH                |
|   76 | RKH                |
|   71 | RTH                |
|   83 | SMH                |
|   78 | UTH                |
|   38 | XLE                |
|  158 | XLF                |
|  244 | XLI                |
|  273 | XLK                |
|   75 | XLP                |
|  216 | XLV                |
|  185 | XLY                |
| 1696 | tickers_classified |

